{"title":"Gritty: The Hero We Deserve","subtitle":"Gritty emerged from the darkness <br>to show us the way.","social":{"title":"The Hero We Deserve","description":"Gritty emerged from the darkness to show us the way.","twitter_desc":"","email_subj":"","email_body":"","keywords":"","site_url":"","twitter_card_url":"","fb_card_url":""},"content":[{"type":"text","value":"PHILADELPHIA — Gritty is running late."},{"type":"text","value":"The puck drops in 50 minutes on a brisk Philadelphia night, and Flyers fans are waiting. But Gritty doesn’t care."},{"type":"text","value":"He was told to leave his locker room at precisely 6:38 p.m., but 6:38 can go to hell. Gritty isn’t coming — not until he’s ready. Gritty does whatever Gritty wants."},{"type":"text","value":"So he lurks behind his locked double doors, on the other side of a one-way window. Gritty sees out. Nobody sees in."},{"type":"text","value":"Gritty is almost five minutes late, and Herman, his no-nonsense stadium security guard, starts pacing the gray-carpeted Wells Fargo Center corridor. Only five people in the world can unlock Gritty’s doors via fingerprint identification. Herman, paid to protect Gritty at all costs, is not one of those people."},{"type":"text","value":"A mysterious man, coming and going from Gritty’s locker room, is one of those people. With slicked-back dark hair and a 5 o’clock shadow mustache, the ominous figure wears a black tie, black suit and black sunglasses."},{"type":"text","value":"The man in black opens the door carefully. Just wide enough for his slim frame to slip through. No wider. Even the slightest glimpse into Gritty’s inner sanctum is strictly forbidden."},{"type":"text","value":"Why the security? The sealed-lip secrecy? The air of mystery and intrigue? Because behind those doors is motherf—ing Gritty: The mascot who kidnapped the public eye, the meme turned pop culture icon, the legend Philadelphians revere as a furry orange emblem for their underdog city."},{"type":"text","value":"Not human. Not monster. Gritty is a species of his own. Gritty will always be an enigma because that’s the whole damn point. His improbable rise to prominence says as much about you as it does him."},{"type":"text","value":"Gritty can’t talk, yet Gritty speaks to the masses. Gritty stands for nothing, but Gritty represents everything. In a dizzying 18 months, Gritty rose from national punch line to national treasure. So he was accused of punching a teenager? So what."},{"type":"text","value":"At 6:44 p.m., the most transcendent personality in the National Hockey League is finally ready. Vanilla Ice’s pulsing, preposterous anthem “Ice Ice Baby” pumps from inside the locker room, the double doors swing open and Gritty arrives in full glory: 7 feet tall, orange as hell, with shaggy dog fur and the torso of a walrus. He's rocking a green and yellow bathing suit and a black T-shirt emblazoned with the dictionary definition of Gritty (impossible to read because Gritty never stands still)."},{"type":"text","value":"Riding a hoverboard as he scans the corridor, Gritty looks exactly as advertised: A Muppet baby who grew up to get hooked on everything, went on a bender, woke up in a Dumpster, casually ate from said Dumpster and hitchhiked to a hockey game."},{"type":"text","value":"Gritty glances at me with his softball-sized eyes, his soulless orange irises dancing to and fro. His toothless mouth is open, as always, revealing a sliver of his pink tongue."},{"type":"text","value":"Gritty knows who I am. Gritty knows why I’m here. But Gritty doesn’t give a shit about me, so he turns his giant head and rolls by, speeding away on his hoverboard at nearly 15 mph."},{"type":"text","value":"The next time I stare face to face with America’s most talked about mascot, he’ll rip my notebook from my hands and throw it to the ground in disgust."},{"type":"gallery","value":{"id":"1","images":[{"src":"7.jpg","caption":"This is a great caption for the first photo.","alt":"Some alt text","area":"big","position":"0% 20%"},{"src":"21.jpg","caption":"This is an equally great caption for the second picture.","alt":"Some alt text","area":"sm1","position":"0% 15%"},{"src":"20.jpg","caption":"This is an equally great caption for the second picture.","alt":"Some alt text","area":"sm2","position":""},{"src":"8.jpg","caption":"This is an equally great caption for the second picture.","alt":"Some alt text","area":"sm3","position":""},{"src":"22.jpg","caption":"This is an equally great caption for the second picture.","alt":"Some alt text","area":"sm4","position":"0% 70%"}]}},{"type":"text","value":"Gritty refused to do it."},{"type":"text","value":"His people scoffed at my request to meet him at his favorite lunch spot for a soul-baring, warts-and-all profile. They rejected a studio photo shoot with Gritty. They refused a brief sit-down meeting at a private location. They barely listened to my last-ditch plea for a two-minute exchange with Gritty non-verbally answering three questions submitted in advance."},{"type":"text","value":"It took three phone conversations, 15 emails and 91 days just to get on Gritty’s calendar at a"},{"type":"text","value":"Flyers game. I was told getting any access to Gritty, a mascot from America’s fourth favorite professional sport, should be considered “a big win.”"},{"type":"text","value":"That might have sounded like fake news in September 2018 when Gritty made his debut to ridicule — no, evisceration. But those early, dark hours already seem like forever ago, before he amassed a legion of followers on social media, became a popular guest on late night shows and made a cameo on “The Simpsons.”"},{"type":"text","value":"“In the history of modern day mascots… no one ever did it as successfully and as fast as Gritty,” says David Raymond, better known as the original Phillie Phanatic, from 1978 to 1994. “And I don’t know how many might be able to do it afterward.”"},{"type":"text","value":"Legend has it Gritty did it all with one tweet. When the Pittsburgh Penguins Twitter account mocked Gritty’s debut tweet in September 2018, Gritty fired back in less than 10 minutes with the now famous line, “Sleep with one eye open tonight, bird.”"},{"type":"text","value":"Yes, a threat. In one pendulum-swinging moment, Gritty melted the orange and black hearts of Flyers fans, winning the internet along the way, right?"},{"type":"text","value":"It’s a nice story, but oversimplified, just like most analysis of Gritty."},{"type":"text","value":"A product of social media and the cultural zeitgeist, Gritty fulfills our natural human desire to connect with something hopeful, a unifying force in polarizing times. He’s a mirror, reflecting only what you want to see. In a world full of wrong, Gritty is everything that’s right. A savior you never knew you needed."},{"type":"text","value":"“People who don’t even like hockey know who Gritty is,” says Jessica Myrick, a Penn State University professor of communications who researches cat videos and teaches a course in"},{"type":"text","value":"social media. “He is permeating pop culture in a way that’s pretty much unlike any other mascot.”"},{"type":"text","value":"And yet we know nothing about Gritty that Gritty doesn’t want us to know. His official backstory — he was discovered in the Wells Fargo Center during construction — is a lie. The Flyers stole it from the origin of their minor league mascot in Allentown. Gritty later revealed his great grand-Gritty washed up on the Jersey Shore, and trivial details like Gritty’s love for hot dogs and Lizzo have been gleaned from observation."},{"type":"text","value":"Everything else? Rumor. Innuendo. Academics taking a stab at explaining the inexplicable. Even Herman isn’t allowed to do interviews, and the Flyers refuse to reveal the man in black’s name."},{"type":"text","value":"We don’t know where Gritty lives or what he does in his free time. We don’t know who his parents are or if he has a girlfriend or boyfriend or any friends at all."},{"type":"text","value":"We don’t even know if Gritty is OK."},{"type":"text","value":"You know how Gritty’s eyes are always bouncing around? That’s possibly a sign of cranial nerve palsy, said Anthony Tobia, a Rutgers University psychiatry professor. Sadly, Gritty probably fell and suffered a traumatic brain injury, Tobia said."},{"type":"text","value":"Or Gritty’s eyes might also be a symptom of something more scandalous, but Tobia really doesn’t want to go down that road."},{"type":"text","value":"“I don’t think Gritty is huffing, but it is interesting…” Tobia says."},{"type":"text","value":"Still, we gravitate to Gritty. Starry-eyed. Hopeful. Children adore him. Men dream of kindling a bromance with him. And a surprising number of women obsess over him."},{"type":"text","value":"To understand Gritty’s aura, you have to witness it in real life. So, I’ve come to stalk him in the place where he’s loved more than anywhere in the world."},{"type":"picture","value":{"src":"13.jpg","alt":"some alt text","caption":"Another incredible caption","position":"30% 05%","paint-t":"style-1.jpg","paint-b":"style-1.jpg","transform-t":"rotate(-20deg)","transform-b":"rotate(-20deg)","pos-t":"tl","pos-b":"br"}},{"type":"text","value":"Gritty is pissed off."},{"type":"text","value":"It’s the first period of a Flyers game, he’s traipsing through the stands and a piercing voice won’t stop beckoning him."},{"type":"text","value":"“Griiiitty,” a well-dressed woman yells in the high-pitch tone you might use to call a dog. “Griiiiiiittttyyyyyy.”"},{"type":"text","value":"She’s asking Gritty to drop what he’s doing and take a photo with her young daughter. Gritty stops in his tracks, drops his head and slumps his shoulders as if to say, “Can’t you see I’m busy here?”"},{"type":"text","value":"But Gritty can’t disappoint a child, a rare insight into his complex psyche. So he climbs to the top of the section for the photo."},{"type":"text","value":"When I look up from my notebook seconds later, the woman and her daughter are gone. It’s just Gritty. Two feet away. Staring down at me. Gritty extends his four-fingered hand, and I don’t know what to do. Shake it? High-five him? Ask him what it’s like to be Gritty? This, I realize, is my chance to approach the unapproachable."},{"type":"text","value":"Too late. Gritty rips my notebook away, bends over to study my chicken scratch and spikes it to the ground like a football."},{"type":"text","value":"In other words: Welcome to Philly, ya prick."},{"type":"text","value":"This is Gritty: at all times a social chameleon. He is exactly who he needs to be exactly when he needs to be. One minute, he’s petting a child on the head like a kitten. The next, he’s thrusting his oversized midsection toward a Washington Capitals fan in an unmistakable “Screw you.”"},{"type":"text","value":"Angry, then loving. Aggressive, then gentle. Gritty."},{"type":"text","value":"“He brings this aroma that people cherish,” says Bernie Parent, the NHL Hall of Famer and tough guy goalie of the 1970s Flyers. “The way he comes across is always with love and happiness and hope, and that’s what life is all about.”"},{"type":"text","value":"And in Philly, sitting in his virtual throne at Wells Fargo Center, Gritty is a God. He unabashedly speaks to Philadelphia in ways the Broad Street Bullies or Rocky Balboa never could. You say Philly residents can’t correctly pronounce the word “water?” One look at Gritty says, “F-you, man. They’re not trying to.”"},{"type":"text","value":"“If you were to take a cheesesteak and cook it down and throw it in a centrifuge and take that essence and pour it on a sunflower, you’d get Gritty,” says Mike Preite, a Flyers fan from suburban Gilbertsville, Pennsylvania."},{"type":"text","value":"Before the game, Greg Koba, a sturdy 28-year-old with a reddish-orange beard and a season ticket package, walks to the center of a throng of fans encircling Gritty. Gritty lifts Koba’s arms up like he’s going to frisk him. Instead, Gritty turns Koba around and hugs him from behind, posing like Jack and Rose on the railing of the Titanic. The tough guy hockey fan walks away beaming from the intimate encounter, frantically trying to confirm his smirking buddy snapped a photo."},{"type":"text","value":"“He’s exactly what Philadelphia is,” Koba says. “Everyone hated him at first, but guess what? Everyone hates Philadelphia at first, and now they all love us, and now everyone loves Gritty. Look at him. He’s the best.”"},{"type":"text","value":"When play time is over, Herman guides a half-dozen bodies out of the way, clearing a path for Gritty to embark on a hoverboard parade around the concourse. As Gritty speeds past, grown men shout his name and risk spilling their $12 beer to fumble with their phones for a picture. “He’s the king of Philly, man,” says fan Dominic DiFilippo."},{"type":"text","value":"Indeed. In October 2018, the Philadelphia City Council passed a resolution welcoming Gritty as “an icon of hope and resistance.”"},{"type":"text","value":"“Gritty may be a hideous monster, but he is our hideous monster,” Councilwoman Helen Gym wrote in the 750-word resolution."},{"type":"text","value":"Yet plenty of Flyers fans have never had an up-close encounter with Gritty. Many fans describe him as mysterious, and several children told me they’re afraid of him. Weird? No. That’s just Philly, says Brogan Garvey, a 25-year-old who lives in the trendy Manayunk neighborhood."},{"type":"text","value":"“People think he’s a little bit creepy,” she says. “But I like it.”"},{"type":"text","value":"The real question isn’t why Philly loves Gritty. It’s this: What the hell is wrong with the rest of you?"},{"type":"gallery","value":{"id":"2","images":[{"src":"14.jpg","caption":"This is a great caption for the first photo.","alt":"Some alt text","area":"big","position":"0% 10%"},{"src":"17.jpg","caption":"This is an equally great caption for the second picture.","alt":"Some alt text","area":"sm1","position":"0% 20%"},{"src":"19.jpg","caption":"This is an equally great caption for the second picture.","alt":"Some alt text","area":"sm2","position":"0% 5%"}]}},{"type":"text","value":"Gritty is at the front door."},{"type":"text","value":"It’s Stephen Colbert’s 2019 Super Bowl party skit and Gritty just crashed it, a surprise guest invited by actor Patrick Stewart."},{"type":"text","value":"“Gritty and I go way back,” Stewart says in his rich, classically trained voice with crisp elocution. “We used to be in the Royal Shakespeare Company together.”"},{"type":"text","value":"“Oh, sure, Hamlet,” Colbert says as Gritty shows off a human skull."},{"type":"text","value":"“No, Gritty played Juliet,” Stewart says. “I have no idea where the skull came from.”"},{"type":"text","value":"From Colbert to Fallon to the Simpsons, Gritty has become so popular it’s no longer a surprise to see him anywhere. As a tattoo on a fan’s beer belly. As a butter sculpture at the Pennsylvania Farm Show. As a meme for, well, anything."},{"type":"text","value":"But why? What is it about Gritty that appeals to adults who don’t watch hockey and don’t even have ties to Philadelphia?"},{"type":"text","value":"It’s difficult to explain, says Dustin Kidd, a Temple University sociology professor. But that didn’t stop him from trying."},{"type":"text","value":"“Gritty sort of stands for all and is a very hopeful figure that is uniting, which is really striking at a time where we feel so divided,” said Kidd, who teaches a course in popular culture. “He’s a hero and an anti-hero at the same time.”"},{"type":"text","value":"But Gritty’s realm is Twitter, not scholarly journals. It’s social media that gave him a chance to develop the voice that older mascots never had."},{"type":"text","value":"“The Gritty success was just throwing gasoline on a fire with social media,” says Raymond, who ended his tenure as the Phanatic one year before Windows 95 launched. “He can answer critics. He can fire barbs back. He can be funny. And you learn a little bit more about his personality.”"},{"type":"text","value":"Social media doesn’t deserve all the credit. Hooper, the Detroit Pistons mascot, has tweeted more than 4,000 times since 2009. But please raise your hand if you live outside of Detroit and have ever seen a Hooper tweet, let alone actually heard of Hooper — who may or may not be a horse but honestly isn’t worth googling again because not knowing proves the point. Twitter didn’t make Gritty. Gritty’s Twitter made Gritty."},{"type":"text","value":"Gritty’s feed is clever and funny. It’s topical and authentic. It oozes his literally-coming-in-on-a-wrecking-ball mentality. Case in point: Gritty once tweeted a photo of himself on ice dressed as Wonder Woman. The caption? “Skirts are MAD comfy! Who knew? My undercarriage feels NOICEE.”"},{"type":"text","value":"“I don’t know any other mascot who would say that,” says John Cudo, formerly known as Crunch, the original Minnesota Timberwolves mascot. “He is the one guy who would say that because he knows who he is… he has got a grasp on who he is in a way that a lot of (mascots) don’t get until 10 years in.”"},{"type":"text","value":"It’s not just what Gritty is doing. It’s what you all did to him. It’s the fact that Gritty is so memeable."},{"type":"text","value":"Massive and orange, with a mouth permanently agape, Gritty has long stringy beard and bulging eyes described nine out of 10 times as googly. Who wouldn’t stop and look at Gritty when he pops up on your phone screen, asks Hilde Van Den Bulck, who heads Drexel’s University’s Department of Communications and closely studies fandom and celebrity culture."},{"type":"text","value":"“It’s like the mascot of your nightmares,” adds Cudo, who also spent time as Moondog, the Cleveland Cavaliers mascot."},{"type":"text","value":"The second part of Gritty’s meme-ability is that he remains a blank canvas, Van Den Bulck said. From the far left to the far right and whatever apolitical interest you have in between, Gritty can always be on your side."},{"type":"text","value":"That’s good for making memes, but even better for making friends. Gritty is so agnostic it allows us to form what academics call “parasocial relationships” with him. That’s a fancy way of saying you invest emotional time and energy into following Gritty like he’s your actual friend. Yet Gritty has no fucking clue you even exist."},{"type":"text","value":"“It says a lot about us that we sort of take our media figures, be that an NHL mascot or a politician or a musician, and we find aspects of ourselves in them,” Myrick says. “We are kind of in a moment in society where people are just over trying to perform to others and celebrating authenticity. And Gritty is very authentic.”"},{"type":"twitter","value":{"desc":"Click on Gritty to fire up some fire tweets."}},{"type":"text","value":"Gritty is like Donald Trump."},{"type":"text","value":"Remember when the president said he could stand on Fifth Avenue and shoot somebody and wouldn’t lose any voters? What would Gritty have to do on Broad Street to make people turn on him?"},{"type":"text","value":"In January, a Philadelphia Inquirer reporter broke what he called “the scoop of the century.” Gritty was accused of punching a 13-year-old boy at a meet and greet event. Not just any 13-year-old boy, but a Flyers fan.<i>The son of a season ticket holder.</i>It was a he-said, Gritty-said case, the paper reported, and police were now investigating."},{"type":"text","value":"For a unnerving few days, it seemed the entire Gritty mythos might collapse. Gritty could be disgraced, even imprisoned. The end of an aura."},{"type":"text","value":"Police started doing interviews and checking security tapes, which didn't capture the incident. The Flyers conducted a “thorough investigation” of their own, interviewing Gritty and the man in black, suddenly a pivotal witness to a potential crime."},{"type":"text","value":"A #FreeGritty hashtag exploded as Gritty fans across the globe held their collective breath."},{"type":"text","value":"Finally, the official word came: Gritty was cleared. The damning allegations that threatened his legend proved only to elevate it."},{"type":"text","value":"Still, some wonder if Gritty is in the twilight of his 15 minutes of fame."},{"type":"text","value":"For at least four generations, Gritties have lurked in the shadows, living a quiet existence far from the tweets and likes and endless demand for selfies. Now everyone wants a piece of Gritty. Some wonder if he will wither under the spotlight. Think Britney Spears at the barber shop, but worse."},{"type":"text","value":"“Pop culture is definitely something that ebbs and flows,” Myrick says. “And some icons have more staying power than others.”"},{"type":"text","value":"The San Diego Chicken was a megastar of the 1970s and ‘80s, arguably the most famous mascot of all-time. Today? He makes a few appearances each summer in minor league ballparks, soaking up a final taste of the admiration that once encased him."},{"type":"text","value":"“Everybody has had their heyday,” says Glenn Street, who made his debut in 1983 as Harvey The Hound, the mascot for the Calgary Flames. “I think this is Gritty’s time in the sun.”"},{"type":"text","value":"Maybe that’s true. Or maybe it’s professional jealousy. Whether they admit it or not, other mascots want what Gritty has, says Cudo, who noted Gritty’s antics at Flyers games are far from revolutionary."},{"type":"text","value":"“I haven’t really seen anything where I went, ‘Oh, that is groundbreaking stuff,’” Cudo says. “His microphone is just bigger.”"},{"type":"text","value":"But rumors of Gritty’s eventual demise are pointless. If there’s one thing I’ve learned about Gritty it’s this: Gritty doesn’t care."},{"type":"text","value":"“I don’t think he’s a Kardashian,” Van Den Bulck says. “He starts with an actual job and then gets famous for that.”"},{"type":"text","value":"No, Gritty didn’t go looking for fame."},{"type":"text","value":"Fame found Gritty."},{"type":"picture","value":{"src":"18.jpg","alt":"some alt text","caption":"Another incredible caption","position":"0 36%","paint-t":"style-1.jpg","paint-b":"style-1.jpg","transform-t":"rotate(40deg)","transform-b":"rotate(40deg)","pos-t":"tr","pos-b":"bl"}},{"type":"text","value":"Gritty is besieged."},{"type":"text","value":"Within seconds of Gritty arriving in the concourse, a sea of orange and black shirts and jerseys circles him, dotted by the glow of cell phones fixed on the star attraction."},{"type":"text","value":"A young woman approaches Gritty, and he cradles her hands in his in the way you would during a marriage proposal. Her eyes get misty. A little boy comes up next. Gritty poses with one hand on the boy’s head, the other hand holding up two fingers. A white-haired man and his adult son approach, and Gritty dutifully poses between them, one furry arm resting on each of their shoulders. It goes on and on."},{"type":"text","value":"My quest to get to the heart of Gritty is futile."},{"type":"text","value":"No one gets to be alone with Gritty."},{"type":"text","value":"When Gritty finally escapes the crowd, he must wait for the elevator. And Gritty can never stand still, never sit down, never stop performing as long as he’s in the public eye. He’s dancing to the Macarena now just to kill time, waiting for that elevator door to pop open, shimmying toward our photographer."},{"type":"text","value":"The door finally slides open and Gritty goes in first, standing with an elevator attendant, the man in black, 11 members of the Flyers dance team, two photographers, two women from the Flyers marketing staff, me, and of course, Herman."},{"type":"text","value":"This is the most privacy Gritty gets outside of his locker room. Nineteen people packed in an elevator with him. For a fleeting moment, the show stops. Gritty is not the meme, the mascot, or the legend. Just Gritty, riding an elevator as Shaina Twain blasts from the man in black’s scooter."},{"type":"text","value":"<p class =\"tilt\">Oh, oh, oh, go totally crazy, forget I'm a lady</p>"},{"type":"text","value":"<p class =\"tilt\">Men's shirts, short skirts</p>"},{"type":"text","value":"<p class =\"tilt\">Oh, oh, oh, really go wild yeah, doin' it in style</p>"},{"type":"text","value":"<p class =\"tilt\">Oh, oh, oh, get in the action, feel the attraction</p>"},{"type":"text","value":"<p class =\"tilt\">Color my hair, do what I dare…</p>"},{"type":"text","value":"THUD."},{"type":"text","value":"Gritty collapses in the corner, apparently exhausted. Nobody knows if it’s a joke, but they laugh anyway. The elevator dings. Herman steps out, stretches his arm to keep the door from closing on us and shouts: “OK, let’s go.”"},{"type":"text","value":"One by one, we file out of the elevator and the crowd awaits."},{"type":"text","value":"Gritty isn’t going anywhere."},{"type":"text","value":"Not yet."},{"type":"text","value":"Gritty does whatever Gritty wants. <i class=\"material-icons sized orange\">sports_hockey</i>"},{"type":"picture","value":{"src":"23.jpg","alt":"some alt text","caption":"Another incredible caption","position":"0% 20%","paint-t":"style-1.jpg","paint-b":"style-1.jpg","transform-t":"rotate(-20deg)","transform-b":"rotate(-20deg)","pos-t":"tl","pos-b":"br"}}],"section-title":"Credits","bios":[{"title":"Reporting and writing","text":"<a href=mailto:snietomunoz@njadvancemedia.com>Sophie Nieto-Munoz</a> and <a href=mailto:bolivier@njadvancemedia.com>Bobby Olivier</a>"},{"title":"Photo coordinator","text":"<a href=mailto:psapone@njadvancemedia.com>Patti Sapone</a>"},{"title":"Photography","text":"Scott Anderson, Steve Hockstein, Michael Mancuso, Andrew Mills, Ed Murray, Patti Sapone, Matt Smith and Joe Warner"},{"title":"Design and development","text":"<a href=mailto:cgrom@njadvancemedia.com>Cassidy Grom</a> and <a href=mailto:akkakar@njadvancemedia.com>Arjun Kakkar</a>"},{"title":"Project editor","text":"<a href=mailto:agraf@njadvancemedia.com>Ashleigh Graf</a>"},{"title":"Additional contributors","text":"<a href=mailto:apasseggio@njadvancemedia.com>Alyssa Passeggio</a>"}],"pub":"Published on 26 July 2020."}